======================================================
Simple brace expansions
======================================================
[{}]
[*.{a,b,c}]
[{s,a}c]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (brace_expansion))))
  (section
    (header
      (section_name
        (wildcard)
        (brace_expansion
          (expansion_string)
          (expansion_string)
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)
          (expansion_string))))))

======================================================
Brace exapansions with empty strings
======================================================
[{a,}]
[{,a}]
[{,a,}]
[{a,,b}]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)
          (expansion_string))))))

======================================================
Brace expansion with escaped characters
======================================================
[{a\,,\,,b}]
[{a\}}]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string
            (escaped_character))
          (expansion_string
            (escaped_character))
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string
            (escaped_character)))))))

======================================================
Brace expansions with nested expressions
======================================================
[/a/**{b/{c,{1..9}},e[bc]/{f?.?*,g}}]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (wildcard)
        (brace_expansion
          (expansion_string
            (brace_expansion
              (expansion_string)
              (expansion_string
                (integer_range
                  start: (integer)
                  end: (integer)))))
          (expansion_string
            (character_choice
              (character)
              (character))
            (brace_expansion
              (expansion_string
                (wildcard)
                (wildcard)
                (wildcard))
              (expansion_string))))))))

======================================================
Integer Range
======================================================
[{10..2}]
[{1..-20}]
[{-10..2}]
[{-1..-20}]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (integer_range
          start: (integer)
          end: (integer)))))
  (section
    (header
      (section_name
        (integer_range
          start: (integer)
          end: (integer)))))
  (section
    (header
      (section_name
        (integer_range
          start: (integer)
          end: (integer)))))
  (section
    (header
      (section_name
        (integer_range
          start: (integer)
          end: (integer))))))

======================================================
Brace expansions with integers
======================================================
[{10a}]
[{-3a}]
[{-3b,c}]
[{30,-44,5}]
------------------------------------------------------

(editorconfig
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)
          (expansion_string)))))
  (section
    (header
      (section_name
        (brace_expansion
          (expansion_string)
          (expansion_string)
          (expansion_string))))))
